/*
var points = [
    {
        name: '大连市獐子岛海域国家级海洋牧场示范区',
        lat: "39°0.386'",
        lon: "122°54.732'",
        cat: 1
    },
    {
        name: '大连市海洋岛海域国家级海洋牧场示范区',
        lat: "39°08'6.50",
        lon: "123°07'36.2",
        cat: 1
    },
    {
        name: '大连市财神岛海域国家级海洋牧场示范区',
        lat: "39°11'59.563",
        lon: "122°17'32.118",
        cat: 1
    },
    {
        name: '大连市蚂蚁岛海域国家级海洋牧场示范区',
        lat: "39°10'55.262",
        lon: "123°31'23.077",
        cat: 1
    },
    {
        name: '大连市大长山岛海域金茂国家级海洋牧场示范区',
        lat: "39°22'08.130",
        lon: "122°46'13.334",
        cat: 1
    },
    {
        name: '大连市小长山岛海域经典国家级海洋牧场示范区',
        lat: "39°20'32.208",
        lon: "122°52'58.953",
        cat: 1
    },
    {
        name: '大连市海洋岛海域益得国家级海洋牧场示范区',
        lat: "39°14'56.60",
        lon: "123°29'11.20",
        cat: 1
    },
    {
        name: '大连市大长山岛海域龙腾湾国家级海洋牧场示范区',
        lat: "39°23'19.065",
        lon: "122°40'26.293",
        cat: 1
    },
    {
        name: '大连市大长山岛海域金砣国家级海洋牧场示范区',
        lat: "39°21'39.600",
        lon: "122°49'44.400",
        cat: 1
    },
    {
        name: '大连小长山岛海域中旺国家级海洋牧场示范区',
        lat: "39°15'59.80",
        lon: "122°49'59.16",
        cat: 1
    },
    {
        name: '大连长海县海域联友国家级海洋牧场示范区',
        lat: "39°14'55.56",
        lon: "122°34'47.30",
        cat: 1
    },
    {
        name: '大连市王家岛海域富谷国家级海洋牧场示范区',
        lat: "39°29'06.10",
        lon: "123°06'34.20",
        cat: 1
    },
    {
        name: '大连市石城岛海域上品堂国家级海洋牧场示范区',
        lat: "39°30'11.732",
        lon: "122°56'18.416",
        cat: 1
    },
    {
        name: '大连市平岛海域鑫玉龙国家级海洋牧场示范区',
        lat: "39°19'53.41",
        lon: "122°20'20.34",
        cat: 1
    },
    {
        name: '大连市大李家海域迈童国家级海洋牧场示范区',
        lat: "39°02'02.0",
        lon: "122°15'10.0",
        cat: 1
    },
    {
        name: '大连市七顶山海域新时代国家级海洋牧场示范区',
        lat: "39°18'21.600",
        lon: "121°24'54.000",
        cat: 1
    },
    {
        name: '大连金普新区杏树屯海域鹏兴国家级海洋牧场示范区',
        lat: "39°16'30.132",
        lon: "122°19'31.909",
        cat: 1
    },












    {
        name: '大连大长山岛海域壮元海市级海洋牧场示范区',
        lat: "39°21'23.30",
        lon: "122°44'56.80",
        cat: 0
    },
    {
        name: '大连市海洋岛海域市级海洋牧场示范区',
        lat: "39°08'17.80",
        lon: "123°09'36.50",
        cat: 0
    },
    {
        name: '大连庄河海域明胜市级海洋牧场示范区',
        lat: "39°30'17.40",
        lon: "123°08'04.00",
        cat: 0
    },
    {
        name: '大连市鹏兴海洋牧场示范区',
        lat: "39°16'11.278",
        lon: "122°19'34.866",
        cat: 0
    }
];


var converted = [];

points.forEach(function (i) {
    i.gpsLat = conv(i.lat);
    i.gpsLon = conv(i.lon);

    converted.push(i);
});

function conv(i) {

    var h = i.split("°")[0];
    var m = i.split("°")[1].split("'")[0];
    var s = i.split("°")[1].split("'")[1];

    var f = parseFloat(m) + parseFloat(s/60);
    var du = parseFloat(f/60) + parseFloat(h);

    return du;
    
}

$(function () {
    var bpoints = [];
    var bpoints1 = [];
    var bpoints2 = [];

    converted.forEach(function (i, idx) {
        if (idx < 10) {
            bpoints.push(new BMap.Point(i.gpsLon, i.gpsLat));
        } else if (idx < 20) {
            bpoints1.push(new BMap.Point(i.gpsLon, i.gpsLat));
        } else {
            bpoints2.push(new BMap.Point(i.gpsLon, i.gpsLat));
        }
    });


    translateCallback = function (data){
      if(data.status === 0) {
        for (var i = 0; i < data.points.length; i++) {
            converted[i].bLat = data.points[i].lat;
            converted[i].bLon = data.points[i].lng;
        }

      }
    }


    translateCallback1 = function (data){
      if(data.status === 0) {
        for (var i = 0; i < data.points.length; i++) {
            converted[10 + i].bLat = data.points[i].lat;
            converted[10 + i].bLon = data.points[i].lng;
        }

      }
    }


    translateCallback2 = function (data){
      if(data.status === 0) {
        for (var i = 0; i < data.points.length; i++) {
            converted[20 + i].bLat = data.points[i].lat;
            converted[20 + i].bLon = data.points[i].lng;
        }

        console.log("--" + JSON.stringify(converted));
      }
    }


    setTimeout(function(){
        var convertor = new BMap.Convertor();
        convertor.translate(bpoints, 1, 5, translateCallback)
    }, 1000);

    setTimeout(function(){
        var convertor = new BMap.Convertor();
        convertor.translate(bpoints1, 1, 5, translateCallback1)
    }, 3000);

    setTimeout(function(){
        var convertor = new BMap.Convertor();
        convertor.translate(bpoints2, 1, 5, translateCallback2)
    }, 5000);
});
*/

var points = [
  {
    "name": "大连市獐子岛海域国家级海洋牧场示范区",
    "lat": "39°0.386'",
    "lon": "122°54.732'",
    "cat": 1,
    "gpsLat": 39.006433333333334,
    "gpsLon": 122.9122,
    "bLat": 39.01316249954195,
    "bLon": 122.92372069898795
  },
  {
    "name": "大连市海洋岛海域国家级海洋牧场示范区",
    "lat": "39°08'6.50",
    "lon": "123°07'36.2",
    "cat": 1,
    "gpsLat": 39.13513888888889,
    "gpsLon": 123.12672222222223,
    "bLat": 39.14273606430783,
    "bLon": 123.13874568653719
  },
  {
	"ranchId": 2,
    "name": "大连市财神岛海域国家级海洋牧场示范区",
    "lat": "39°11'59.563",
    "lon": "122°17'32.118",
    "cat": 1,
    "gpsLat": 39.19987861111111,
    "gpsLon": 122.292255,
    "bLat": 39.20728124984779,
    "bLon": 122.30369715743528
  },
  {
    "ranchId": 13,
    "name": "大连市蚂蚁岛海域国家级海洋牧场示范区",
    "lat": "39°10'55.262",
    "lon": "123°31'23.077",
    "cat": 1,
    "gpsLat": 39.18201722222222,
    "gpsLon": 123.52307694444444,
    "bLat": 39.188808051858246,
    "bLon": 123.535191121157
  },
  {
	"ranchId": 3,
    "name": "大连市大长山岛海域金茂国家级海洋牧场示范区",
    "lat": "39°22'08.130",
    "lon": "122°46'13.334",
    "cat": 1,
    "gpsLat": 39.368925,
    "gpsLon": 122.77037055555556,
    "bLat": 39.37642283904941,
    "bLon": 122.7819345760901
  },
  {
	"ranchId": 4,
    "name": "大连市小长山岛海域经典国家级海洋牧场示范区",
    "lat": "39°20'32.208",
    "lon": "122°52'58.953",
    "cat": 1,
    "gpsLat": 39.34228,
    "gpsLon": 122.8830425,
    "bLat": 39.34967330935153,
    "bLon": 122.8944137026934
  },
  {
	"ranchId": 5,
    "name": "大连市海洋岛海域益得国家级海洋牧场示范区",
    "lat": "39°14'56.60",
    "lon": "123°29'11.20",
    "cat": 1,
    "gpsLat": 39.24905555555556,
    "gpsLon": 123.48644444444444,
    "bLat": 39.256601689637755,
    "bLon": 123.49851667517405
  },
  {
    "ranchId": 10,
    "name": "大连市大长山岛海域龙腾湾国家级海洋牧场示范区",
    "lat": "39°23'19.065",
    "lon": "122°40'26.293",
    "cat": 1,
    "gpsLat": 39.38862916666667,
    "gpsLon": 122.67397027777778,
    "bLat": 39.395634890141054,
    "bLon": 122.6855176998479
  },
  {
    "name": "大连市大长山岛海域金砣国家级海洋牧场示范区",
    "lat": "39°21'39.600",
    "lon": "122°49'44.400",
    "cat": 1,
    "gpsLat": 39.361,
    "gpsLon": 122.829,
    "bLat": 39.36787850497113,
    "bLon": 122.84065078572145
  },
  {
    "name": "大连小长山岛海域中旺国家级海洋牧场示范区",
    "lat": "39°15'59.80",
    "lon": "122°49'59.16",
    "cat": 1,
    "gpsLat": 39.26661111111111,
    "gpsLon": 122.8331,
    "bLat": 39.273498381005794,
    "bLon": 122.84473034451644
  },
  {
    "name": "大连长海县海域联友国家级海洋牧场示范区",
    "lat": "39°14'55.56",
    "lon": "122°34'47.30",
    "cat": 1,
    "gpsLat": 39.24876666666667,
    "gpsLon": 122.57980555555555,
    "bLat": 39.25541857126673,
    "bLon": 122.59123357954643
  },
  {
    "ranchId": 6,
    "name": "大连市王家岛海域富谷国家级海洋牧场示范区",
    "lat": "39°29'06.10",
    "lon": "123°06'34.20",
    "cat": 1,
    "gpsLat": 39.48502777777778,
    "gpsLon": 123.1095,
    "bLat": 39.49287322016886,
    "bLon": 123.12154280331258
  },
  {
    "ranchId": 7,
    "name": "大连市石城岛海域上品堂国家级海洋牧场示范区",
    "lat": "39°30'11.732",
    "lon": "122°56'18.416",
    "cat": 1,
    "gpsLat": 39.50325888888889,
    "gpsLon": 122.93844888888889,
    "bLat": 39.510052767075855,
    "bLon": 122.95016662420387
  },
  {
    "name": "大连市平岛海域鑫玉龙国家级海洋牧场示范区",
    "lat": "39°19'53.41",
    "lon": "122°20'20.34",
    "cat": 1,
    "gpsLat": 39.33150277777778,
    "gpsLon": 122.33898333333333,
    "bLat": 39.338474559773886,
    "bLon": 122.35072971594442
  },
  {
    "name": "大连市大李家海域迈童国家级海洋牧场示范区",
    "lat": "39°02'02.0",
    "lon": "122°15'10.0",
    "cat": 1,
    "gpsLat": 39.03388888888889,
    "gpsLon": 122.25277777777778,
    "bLat": 39.041087559586934,
    "bLon": 122.2642279654055
  },
  {
    "name": "大连市七顶山海域新时代国家级海洋牧场示范区",
    "lat": "39°18'21.600",
    "lon": "121°24'54.000",
    "cat": 1,
    "gpsLat": 39.306,
    "gpsLon": 121.415,
    "bLat": 39.31355747177654,
    "bLon": 121.42691120210822
  },
  {
    "name": "大连金普新区杏树屯海域鹏兴国家级海洋牧场示范区",
    "lat": "39°16'30.132",
    "lon": "122°19'31.909",
    "cat": 1,
    "gpsLat": 39.275036666666665,
    "gpsLon": 122.32553027777777,
    "bLat": 39.28200033387832,
    "bLon": 122.33726352079667
  },
  {
    "ranchId": 8,
    "name": "大连大长山岛海域壮元海市级海洋牧场示范区",
    "lat": "39°21'23.30",
    "lon": "122°44'56.80",
    "cat": 0,
    "gpsLat": 39.35647222222222,
    "gpsLon": 122.7491111111111,
    "bLat": 39.36406603741021,
    "bLon": 122.76062678700367
  },
  {
    "ranchId": 9,
    "name": "大连市海洋岛海域市级海洋牧场示范区",
    "lat": "39°08'17.80",
    "lon": "123°09'36.50",
    "cat": 0,
    "gpsLat": 39.13827777777778,
    "gpsLon": 123.1601388888889,
    "bLat": 39.14526058321244,
    "bLon": 123.1723029658347
  },
  {
    "ranchId": 12,
    "name": "大连庄河海域明胜市级海洋牧场示范区",
    "lat": "39°30'17.40",
    "lon": "123°08'04.00",
    "cat": 0,
    "gpsLat": 39.50483333333333,
    "gpsLon": 123.13444444444444,
    "bLat": 39.512491875646,
    "bLon": 123.14654670122474
  },
  {
    "name": "大连市鹏兴海洋牧场示范区",
    "lat": "39°16'11.278",
    "lon": "122°19'34.866",
    "cat": 0,
    "gpsLat": 39.269799444444445,
    "gpsLon": 122.32635166666667,
    "bLat": 39.276755070757375,
    "bLon": 122.33808955467175
  },
  {
    "ranchId": 11,
    "name": "大连市小长山岛百聚鑫水产品养殖场扇贝体征智能识别系统",
    "lat": "39°18'46.22",
    "lon": "122°47'7.67",
    "cat": 1,
    "gpsLat": 39.31283888888889,
    "gpsLon": 122.78546388888888,
    "bLat": 39.32002301484518,
    "bLon": 122.79707432516011
  }
];


